int/resources/objectRepo/xmlTemplates/opera/Reservation/req_ReserveInventoryItems.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/rsv/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ReserveInventoryItemsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:HotelCode/>
         <v91:ReservationID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
         <v9:ItemHoldIDList>
            <v91:ItemHoldID/>
         </v9:ItemHoldIDList>
         <v9:InventoryItems ItemClassCode="?">
            <v91:Item ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?">
               <v91:Item Code="?" DefaultDuration="?" FixedCharge="?" ItemPool="?" Name="?" OutsideStay="?" RequiredForBooking="?" SellInEvent="?" SellInReservation="?" SellSeparate="?">
                  <v91:Description/>
                  <v91:AvailabilityPeriod EndTime="?" StartTime="?"/>
                  <v91:TimeSpan>
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:TimeSpan>
                  <v91:Quantity/>
                  <v91:ItemHoldID/>
               </v91:Item>
               <v91:Quantity/>
               <v91:TimeSpan End="?" Start="?"/>
               <v91:Source>
                  <v91:RatePlanCode/>
                  <v91:PackageCode/>
                  <v91:BlockID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                  <v91:WelcomeOffer/>
               </v91:Source>
            </v91:Item>
         <v91:Item ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?">
               <v91:Item Code="?" DefaultDuration="?" FixedCharge="?" ItemPool="?" Name="?" OutsideStay="?" RequiredForBooking="?" SellInEvent="?" SellInReservation="?" SellSeparate="?">
                  <v91:Description/>
                  <v91:AvailabilityPeriod EndTime="?" StartTime="?"/>
                  <v91:TimeSpan>
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:TimeSpan>
                  <v91:Quantity/>
                  <v91:ItemHoldID/>
               </v91:Item>
               <v91:Quantity/>
               <v91:TimeSpan End="?" Start="?"/>
               <v91:Source>
                  <v91:RatePlanCode/>
                  <v91:PackageCode/>
                  <v91:BlockID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                  <v91:WelcomeOffer/>
               </v91:Source>
            </v91:Item><v91:Item ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?">
               <v91:Item Code="?" DefaultDuration="?" FixedCharge="?" ItemPool="?" Name="?" OutsideStay="?" RequiredForBooking="?" SellInEvent="?" SellInReservation="?" SellSeparate="?">
                  <v91:Description/>
                  <v91:AvailabilityPeriod EndTime="?" StartTime="?"/>
                  <v91:TimeSpan>
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:TimeSpan>
                  <v91:Quantity/>
                  <v91:ItemHoldID/>
               </v91:Item>
               <v91:Quantity/>
               <v91:TimeSpan End="?" Start="?"/>
               <v91:Source>
                  <v91:RatePlanCode/>
                  <v91:PackageCode/>
                  <v91:BlockID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                  <v91:WelcomeOffer/>
               </v91:Source>
            </v91:Item></v9:InventoryItems>
      </v9:ReserveInventoryItemsRQ>
   </soapenv:Body>
</soapenv:Envelope>